tap "eu-ge-ne/tap"
tap "nats-io/nats-tools"
tap "oven-sh/bun"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Modern, maintained replacement for ls
brew "eza"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Lightweight cloud messaging system
brew "nats-server"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# OCaml package manager
brew "opam"
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Vi 'workalike' with many additional features
brew "vim"
# Web Assembly Binary Toolkit
brew "wabt"
# Why is this running?
brew "witr"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Minimalistic TUI text editor
brew "eu-ge-ne/tap/toy"
# NATS utility
brew "nats-io/nats-tools/nats"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Password manager app
cask "keepassxc"
# GPU-based terminal emulator
cask "kitty"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Process monitor
cask "processspy"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
